#pragma once
#include <cstdint>

enum eTrainType
{
	Freight0 = 0,
	Freight01 = 1,
	Freight02 = 4,
	Freight03 = 7,
	Freight04 = 9,
	Freight05 = 10,
	Freight06 = 11,
	Freight07 = 12,
	Freight08 = 14,
	Freight09 = 15,
	Freight10 = 17,
	Freight11 = 18,
	Freight12 = 20,
	Freight13 = 22,
	Freight14 = 23,
	Metro0 = 21,
	Metro01 = 24
};

enum eMoneyHashes // 1.50
{
	hash_10_millions = 312105838, // SERVICE_EARN_ROCKSTAR
	hash_180_thousands = 3267748665, // 120k use
	hash_150_thousands = -1027218631,
	hash_50_thousands = 569170531,
	hash_15_millions_limit = -1586170317,

	test_750_thousands = 0x0CD9EBA6,
	test_12_millions = 393059668,
	test_10k_money_gift = 1734805203,
	test_15_millions = 2708796979,
};
enum Globals
{
	/* 1.51 */
	player_stat = 1590535,
	player_stat_size = 876,

	remote_nw_otr_ctbe = 1628237,
	remote_nw_otr_ctbe_size = 615,
	remote_nw_otr_ctbe_offset = 533,

	clothes = 262145, // GBFK_TEXP

	off_the_radar_toggle = 2425662,
	off_the_radar_toggle_size = 421,
	off_the_radar_toggle_offset = 200,
	off_the_radar_time = 2439138,
	off_the_radar_time_offset = 70,

	cops_blind_eyes = 2537071,
	cops_blind_eyes_offset1 = 4555, ////GB_PIM_BRIBE
	cops_blind_eyes_offset2 = 4556, ////LEST_NCOPS
	cops_blind_eyes_offset_time = 4558,

	merryweather = 2537071,

	single_player_spawn = 4268340, // shop_controller

	disable_phone = 19469,

	money10k = 262145,
	money10k_offset = 167,

	global_remotes_ceo_money = 1650640,
};
enum RemoteHashes /*1.51*/
{
	/* 1.51 */
	BlockAcces = -582258758,

		WeaponCombatMG = 0xB2930A14,
		WeaponAssaultRifle = 0xF33C83B0,
		WeaponCarbineRifle = 0xDF711959,
		WeaponAdvancedRifle = 0xB2B5325E,
		WeaponSpecialCarbine = 0x968339D,
		WeaponBullpupRifle = 0x815D66E8,
		WeaponPumpShotgun = 0xA9355DCD,
		WeaponSawnoffShotgun = 0x96B412A3,
		WeaponAssaultShotgun = 0x9299C95B,
		WeaponSniperRifle = 0xFE2A352C,
		WeaponHeavySniper = 0x693583AD,
		WeaponGrenadeLauncher = 0x2E764125,
		WeaponRPG = 0x4D36C349,
		WeaponMinigun = 0x2F36B434,
		WeaponGrenade = 0x5E0683A1,
		WeaponStickyBomb = 0x7C119D58,
		WeaponSmokeGrenade = 0x1CD604C7,
		WeaponMolotov = 0x2DD30479,
		WeaponPetrolCan = 0xC69DE3FF,
		WeaponKnife = 0x278D8734,
		WeaponNightstick = 0x5EA16D74,
		WeaponBat = 0x81EE601E,
		WeaponCrowbar = 0x872DC888,
		WeaponGolfclub = 0x88EAACA7,
		WeaponBottle = 0xFA51ABF5,

		VehicleWeaponPistol = 0xA54AE7B7,
		VehicleWeaponCombatPistol = 0xD0AACEF7,
		VehicleWeaponAPPistol = 0xCC8B3905,
		VehicleWeaponMicroSMG = 0xB86AEE5B,
		VehicleWeaponSawnoffShotgun = 0x2E071B5A,
		VehicleWeaponGrenade = 0xA717F898,
		VehicleWeaponSmokeGrenade = 0x65A7D8E9,
		VehicleWeaponStickyBomb = 0x2C804FE3,
		VehicleWeaponMolotov = 0x84D676D4,
		VehicleHealth = 0x98D79EF,

		AmmoPistol = 0x20796A82,
		AmmoSMG = 0x116FC4E6,
		AmmoMG = 0xDE58E0B3,
		AmmoRifle = 0xE4BD2FC6,
		AmmoShotgun = 0x77F3F2DD,
		AmmoSniper = 0xC02CF125,
		AmmoGrenadeLauncher = 0x881AB0A8,
		AmmoRPG = 0x84837FD7,
		AmmoMinigun = 0xF25A01B9,
		AmmoMissileMP = 0xF99E15D0,
		AmmoBulletMP = 0x550447A9,
		AmmoGrenadeLauncherMP = 0xA421A532
	};
}

enum ExplosionTypes
{
	EXPLOSION_GRENADE,
	EXPLOSION_GRENADELAUNCHER,
	EXPLOSION_STICKYBOMB,
	EXPLOSION_MOLOTOV,
	EXPLOSION_ROCKET,
	EXPLOSION_TANKSHELL,
	EXPLOSION_HI_OCTANE,
	EXPLOSION_CAR,
	EXPLOSION_PLANE,
	EXPLOSION_PETROL_PUMP,
	EXPLOSION_BIKE,
	EXPLOSION_DIR_STEAM,
	EXPLOSION_DIR_FLAME,
	EXPLOSION_DIR_WATER_HYDRANT,
	EXPLOSION_DIR_GAS_CANISTER,
	EXPLOSION_BOAT,
	EXPLOSION_SHIP_DESTROY,
	EXPLOSION_TRUCK,
	EXPLOSION_BULLET,
	EXPLOSION_SMOKEGRENADELAUNCHER,
	EXPLOSION_SMOKEGRENADE,
	EXPLOSION_BZGAS,
	EXPLOSION_FLARE,
	EXPLOSION_GAS_CANISTER,
	EXPLOSION_EXTINGUISHER,
	EXPLOSION_PROGRAMMABLEAR,
	EXPLOSION_TRAIN,
	EXPLOSION_BARREL,
	EXPLOSION_PROPANE,
	EXPLOSION_BLIMP,
	EXPLOSION_DIR_FLAME_EXPLODE,
	EXPLOSION_TANKER,
	EXPLOSION_PLANE_ROCKET,
	EXPLOSION_VEHICLE_BULLET,
	EXPLOSION_GAS_TANK,
	EXPLOSION_BIRD_CRAP,
	EXP_TAG_RAILGUN,
	EXP_TAG_BLIMP2,
	EXP_TAG_FIREWORK,
	EXP_TAG_SNOWBALL,
	EXP_TAG_PROXMINE,
	EXP_TAG_VALKYRIE_CANNON,
	EXP_TAG_AIR_DEFENCE,
	EXP_TAG_PIPEBOMB,
	EXP_TAG_VEHICLEMINE,
	EXP_TAG_EXPLOSIVEAMMO,
	EXP_TAG_APCSHELL,
	EXP_TAG_BOMB_CLUSTER,
	EXP_TAG_BOMB_GAS,
	EXP_TAG_BOMB_INCENDIARY,
	EXP_TAG_BOMB_STANDARD,
	EXP_TAG_TORPEDO,
	EXP_TAG_TORPEDO_UNDERWATER,
	EXP_TAG_BOMBUSHKA_CANNON,
	EXP_TAG_BOMB_CLUSTER_SECONDARY,
	EXP_TAG_HUNTER_BARRAGE,
	EXP_TAG_HUNTER_CANNON,
	EXP_TAG_ROGUE_CANNON,
	EXP_TAG_MINE_UNDERWATER,
	EXP_TAG_ORBITAL_CANNON,
	EXP_TAG_BOMB_STANDARD_WIDE,
	EXP_TAG_EXPLOSIVEAMMO_SHOTGUN,
	EXP_TAG_OPPRESSOR2_CANNON,
	EXPLODE_COUNT
};
struct Blip_t {
public:
	__int32 iID; //0x0000 
	__int8 iID2; //0x0004 
	char _0x0005[3];
	BYTE N000010FB; //0x0008 (80 = moves with player, some values will turn icon into map cursor and break it)
	char _0x0009[7];
	float x;
	float y;
	float z;
	char _0x001C[6];
	BYTE bFocused; //0x0022   (Focused? 0100 0000)
	char _0x0023[5];
	char* szMessage; //0x0028 If not null, contains the string of whatever the blip says when selected.
	char _0x0030[16];
	int iIcon; //0x0040
	char _0x0044[4];
	DWORD dwColor; //0x0048 (Sometimes works?)
	char _0x004C[4];
	float fScale; //0x0050 
	__int16 iRotation; //0x0054 Heading
	BYTE bInfoIDType; //0x0056 GET_BLIP_INFO_ID_TYPE
	BYTE bZIndex; //0x0057 
	BYTE bDisplay; //0x0058  Also Visibility 0010
	BYTE bAlpha; //0x0059
};//Size=0x005A
struct BlipList {
public:
	Blip_t* m_Blips[1500]; //0x0000 
	char _0x2EE0[56];
};

enum eGameState : std::uint32_t
{
	Playing = 0
};
enum eBone
{
	SKEL_ROOT = 0x0,
	SKEL_Pelvis = 0x2e28,
	SKEL_L_Thigh = 0xe39f,
	SKEL_L_Calf = 0xf9bb,
	SKEL_L_Foot = 0x3779,
	SKEL_L_Toe0 = 0x83c,
	IK_L_Foot = 0xfedd,
	PH_L_Foot = 0xe175,
	MH_L_Knee = 0xb3fe,
	SKEL_R_Thigh = 0xca72,
	SKEL_R_Calf = 0x9000,
	SKEL_R_Foot = 0xcc4d,
	SKEL_R_Toe0 = 0x512d,
	IK_R_Foot = 0x8aae,
	PH_R_Foot = 0x60e6,
	MH_R_Knee = 0x3fcf,
	RB_L_ThighRoll = 0x5c57,
	RB_R_ThighRoll = 0x192a,
	SKEL_Spine_Root = 0xe0fd,
	SKEL_Spine0 = 0x5c01,
	SKEL_Spine1 = 0x60f0,
	SKEL_Spine2 = 0x60f1,
	SKEL_Spine3 = 0x60f2,
	SKEL_L_Clavicle = 0xfcd9,
	SKEL_L_UpperArm = 0xb1c5,
	SKEL_L_Forearm = 0xeeeb,
	SKEL_L_Hand = 0x49d9,
	SKEL_L_Finger00 = 0x67f2,
	SKEL_L_Finger01 = 0xff9,
	SKEL_L_Finger02 = 0xffa,
	SKEL_L_Finger10 = 0x67f3,
	SKEL_L_Finger11 = 0x1049,
	SKEL_L_Finger12 = 0x104a,
	SKEL_L_Finger20 = 0x67f4,
	SKEL_L_Finger21 = 0x1059,
	SKEL_L_Finger22 = 0x105a,
